Revit 2026 API
RebarCurvesData.AddBarGeometry Method
Overload List
Name | Description
AddBarGeometry(CurveLoop) |  Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully.
AddBarGeometry(IList<Curve>)
Top
See Also
Reference
RebarCurvesData Class
Autodesk.Revit.DB.Structure Namespace